In [5]:
import pandas as pd

df = pd.read_csv("FoodPrice_in_Turkey.csv", encoding = "UTF-8")
df.head()

,Place,ProductId,ProductName,UmId,UmName,Month,Year,Price
0,National Average,52,Rice - Retail,5,KG,5,2013,4.4920
1,National Average,52,Rice - Retail,5,KG,6,2013,4.5786
2,National Average,52,Rice - Retail,5,KG,11,2013,4.7865
3,National Average,52,Rice - Retail,5,KG,12,2013,5.1337
4,National Average,52,Rice - Retail,5,KG,1,2014,5.5099

In [3]:
df.info()

# Bộ dữ liệu có 8 cột, 7381 dòng
# Cột Place, ProductId, ProductName, UmId, UmName, Month, Year chỉ hiện thị
# định danh tên, ngày tháng và order: Norminal
# Cột price: ratio

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7381 entries, 0 to 7380
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Place        7381 non-null   object
 1   ProductId    7381 non-null   int64
 2   ProductName  7381 non-null   object
 3   UmId         7381 non-null   int64
 4   UmName       7381 non-null   object
 5   Month        7381 non-null   int64
 6   Year         7381 non-null   int64
 7   Price        7381 non-null   float64
dtypes: float64(1), int64(4), object(3)
memory usage: 461.4+ KB

In [11]:
product_price_average = df.groupby(["ProductId","ProductName"])["Price"].mean()
product_price_average.head()

ProductId  ProductName
52         Rice - Retail             7.950325
58         Wheat flour - Retail      3.253174
66         Beans (white) - Retail    9.572830
83         Potatoes - Retail         2.297231
92         Eggs - Retail             0.505925
Name: Price, dtype: float64

In [18]:
anually_product_price_average = df.groupby(["Year","ProductId","ProductName"])["Price"].mean()
anually_product_price_average.head()

Year  ProductId  ProductName
2013  52         Rice - Retail              4.747700
      58         Wheat flour - Retail       2.255350
      66         Beans (white) - Retail     6.932800
      92         Eggs - Retail              0.310175
      94         Meat (chicken) - Retail    6.677175
Name: Price, dtype: float64

In [20]:
df["TotalPrice"] = df["UmId"]* df["Price"]
df.head()

,Place,ProductId,ProductName,UmId,UmName,Month,Year,Price,TotalPrice
0,National Average,52,Rice - Retail,5,KG,5,2013,4.4920,22.4600
1,National Average,52,Rice - Retail,5,KG,6,2013,4.5786,22.8930
2,National Average,52,Rice - Retail,5,KG,11,2013,4.7865,23.9325
3,National Average,52,Rice - Retail,5,KG,12,2013,5.1337,25.6685
4,National Average,52,Rice - Retail,5,KG,1,2014,5.5099,27.5495

In [23]:
anually_profit = df.groupby(["ProductId","ProductName","Year"])["TotalPrice"].sum()
anually_profit.head()

ProductId  ProductName    Year
52         Rice - Retail  2013      94.9540
                          2014     350.2320
                          2015     385.6100
                          2016     362.8500
                          2017    1397.1345
Name: TotalPrice, dtype: float64

In [28]:
anually_profit.info()
anually_profit.head(300)

<class 'pandas.core.series.Series'>
MultiIndex: 300 entries, (52, 'Rice - Retail', 2013) to (502, 'Cocoa (powder) - Retail', 2019)
Series name: TotalPrice
Non-Null Count  Dtype
--------------  -----
300 non-null    float64
dtypes: float64(1)
memory usage: 4.3+ KB

ProductId  ProductName              Year
52         Rice - Retail            2013       94.9540
                                    2014      350.2320
                                    2015      385.6100
                                    2016      362.8500
                                    2017     1397.1345
                                               ...
502        Cocoa (powder) - Retail  2015     2199.4750
                                    2016     2201.8000
                                    2017     8443.4710
                                    2018    10851.3630
                                    2019    11558.6385
Name: TotalPrice, Length: 300, dtype: float64